Repository: mubtAAhij/vibeproxy
Catalog: src/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: es_419

# settings.accounts.status.removed-account-from-service
source: ✓ Removed %@ from %@
es_419: ✓ Se eliminó %@ de %@

# settings.accounts.error.failed-to-remove-account
source: Failed to remove account
es_419: No se pudo eliminar la cuenta

# server-manager.provider-toggle.disabled-via-oauth-excluded-models
source: Disabled in config via oauth-excluded-models. Remove the '*' exclusion for %@ to enable it here.
es_419: Deshabilitado en la configuración mediante oauth-excluded-models. Elimina la exclusión '*' para %@ para habilitarlo aquí.

# server-manager.provider-toggle.remains-disabled
source: ⚠️ %@ remains disabled: %@
es_419: ⚠️ %@ permanece deshabilitado: %@

# server-manager.provider-toggle.enabled-provider
source: ✓ Enabled provider: %@
es_419: ✓ Proveedor habilitado: %@

# server-manager.provider-toggle.disabled-provider
source: ⚠️ Disabled provider: %@
es_419: ⚠️ Proveedor deshabilitado: %@

# server-manager.startup.error.resource-path-not-found
source: ❌ Error: Could not find resource path
es_419: ❌ Error: No se pudo encontrar la ruta de recurso

# server-manager.startup.error.binary-not-found-at-path
source: ❌ Error: cli-proxy-api-plus binary not found at %@
es_419: ❌ Error: binario cli-proxy-api-plus no encontrado en %@

# server-manager.startup.error.could-not-resolve-active-config-path
source: Could not resolve active config path
es_419: No se pudo resolver la ruta de configuración activa

# server-manager.process.stopped-with-code
source: Server stopped with code: %d
es_419: Servidor detenido con código: %d

# server-manager.process.started-on-port
source: ✓ Server started on port %d
es_419: ✓ Servidor iniciado en el puerto %d

# server-manager.process.exited-before-ready
source: ⚠️ Server exited before becoming ready
es_419: ⚠️ El servidor terminó antes de estar listo

# server-manager.process.error.failed-to-start-server
source: ❌ Failed to start server: %@
es_419: ❌ No se pudo iniciar el servidor: %@

# server-manager.process.stopping-server-with-pid
source: Stopping server (PID: %d)...
es_419: Deteniendo servidor (PID: %d)...

# server-manager.process.warning.force-killing-server
source: ⚠️ Server didn't stop gracefully, force killing...
es_419: ⚠️ El servidor no se detuvo correctamente, forzando cierre...

# server-manager.process.server-stopped
source: ✓ Server stopped
es_419: ✓ Servidor detenido

# server-manager.error.could-not-find-resource-path
source: Could not find resource path
es_419: No se pudo encontrar la ruta del recurso

# server-manager.error.binary-not-found-at-path
source: Binary not found at %@
es_419: Binario no encontrado en %@

# server-manager.error.could-not-resolve-config-path
source: Could not resolve config path
es_419: No se pudo resolver la ruta de configuración

# server-manager.authentication.process-started
source: ✓ Authentication process started (PID: %d) - browser should open shortly
es_419: ✓ Proceso de autenticación iniciado (PID: %d) - el navegador debería abrirse en breve

# server-manager.authentication.github.browser-opened-with-code
source: 🌐 Browser opened for GitHub authentication. 📋 Code copied to clipboard: %@ Just paste it in the browser! The app will automatically detect when you're authenticated.
es_419: 🌐 Navegador abierto para autenticación de GitHub. 📋 Código copiado al portapapeles: %@ ¡Solo pégalo en el navegador! La app detectará automáticamente cuando te hayas autenticado.

# server-manager.authentication.github.browser-opened-check-device-code
source: 🌐 Browser opened for GitHub authentication. Check your terminal or the opened browser for the device code. The app will automatically detect when you're authenticated.
es_419: 🌐 Navegador abierto para autenticación de GitHub. Revisa tu terminal o el navegador abierto para ver el código de dispositivo. La app detectará automáticamente cuando te hayas autenticado.

# server-manager.authentication.browser-opened-complete-login
source: 🌐 Browser opened for authentication. Please complete the login in your browser. The app will automatically detect when you're authenticated.
es_419: 🌐 Navegador abierto para autenticación. Por favor completa el inicio de sesión en tu navegador. La aplicación detectará automáticamente cuando te hayas autenticado.

# server-manager.authentication.error.process-failed-unexpectedly
source: Authentication process failed unexpectedly
es_419: El proceso de autenticación falló inesperadamente

# server-manager.authentication.error.failed-to-start-auth-process
source: Failed to start auth process: %@
es_419: No se pudo iniciar el proceso de autenticación: %@

# server-manager.authentication.warning.terminating-previous-process-before-retry
source: ⚠️ Terminating previous auth process (%d) before retry: %@
es_419: ⚠️ Terminando proceso de autenticación previo (%d) antes de reintentar: %@

# server-manager.authentication.warning.cleaned-stale-auth-listener-process
source: ⚠️ Cleaned up stale auth listener process: %d
es_419: ⚠️ Proceso de escucha de autenticación obsoleto eliminado: %d

# server-manager.zai-api-key.saved-to-file
source: ✓ Z.AI API key saved to %@
es_419: ✓ Clave API de Z.AI guardada en %@

# server-manager.api-key.saved-successfully
source: API key saved successfully
es_419: Clave API guardada correctamente

# server-manager.custom-provider.error.not-defined-in-config
source: Custom provider '%@' is not defined in config.yaml.
es_419: El proveedor personalizado '%@' no está definido en config.yaml.

# server-manager.custom-provider.api-key.already-exists-in-config
source: ✓ API key for custom provider %@ already exists in config
es_419: ✓ La clave API para el proveedor personalizado %@ ya existe en la configuración

# server-manager.api-key.already-exists-in-config
source: API key already exists in config
es_419: La clave API ya existe en la configuración

# server-manager.custom-provider.api-key.saved-for-provider
source: ✓ Saved API key for custom provider: %@
es_419: ✓ Clave API guardada para el proveedor personalizado: %@

# server-manager.custom-provider.api-key.already-present
source: ✓ Custom provider key already present: %@
es_419: ✓ Clave de proveedor personalizado ya presente: %@

# server-manager.custom-provider.api-key.re-enabled
source: ✓ Re-enabled custom provider key: %@
es_419: ✓ Clave de proveedor personalizado rehabilitada: %@

# server-manager.api-key.already-exists
source: API key already exists
es_419: La clave API ya existe

# server-manager.api-key.already-stored-re-enabled
source: API key was already stored and has been re-enabled
es_419: La clave API ya estaba almacenada y ha sido reactivada

# server-manager.custom-provider.key.removed
source: ✓ Removed custom provider key: %@
es_419: ✓ Clave de proveedor personalizado eliminada: %@

# server-manager.custom-provider.key.removed-duplicate-credential-files
source: ✓ Removed %d duplicate credential files for %@
es_419: ✓ Eliminados %d archivos de credenciales duplicados para %@

# server-manager.custom-provider.key.enabled
source: ✓ Enabled custom provider key: %@
es_419: ✓ Clave de proveedor personalizado habilitada: %@

# server-manager.custom-provider.key.disabled
source: ⚠️ Disabled custom provider key: %@
es_419: ⚠️ Clave de proveedor personalizado deshabilitada: %@

# server-manager.config.error.could-not-locate-bundled-config-yaml
source: Could not locate the bundled config.yaml in the app bundle.
es_419: No se pudo localizar el archivo config.yaml incluido en el paquete de la aplicación.

# server-manager.config.error.could-not-load-base-configuration
source: Could not load the base configuration.
es_419: No se pudo cargar la configuración base.

# server-manager.config.error.failed-to-write-merged-config
source: Failed to write merged config to %@: %@
es_419: No se pudo escribir merged-config en %@: %@

# server-manager.process.warning.found-orphaned-server-processes
source: ⚠️ Found orphaned server process(es): %@
es_419: ⚠️ Se encontraron procesos huérfanos del servidor: %@

# server-manager.process.cleaned-up-orphaned-processes
source: ✓ Cleaned up orphaned processes
es_419: ✓ Procesos huérfanos eliminados

# server-manager.config.error.could-not-load-bundled-config-at-path
source: Could not load the bundled config at %@.
es_419: No se pudo cargar el config incluido en %@.

# server-manager.config.error.could-not-load-user-config-at-path
source: Could not load the user config at %@.
es_419: No se pudo cargar la configuración de usuario en %@.

# server-manager.config.error.root-must-be-yaml-mapping
source: Config at %@ must be a YAML mapping at the root.
es_419: La configuración en %@ debe ser un mapeo YAML en la raíz.

# server-manager.config.error.failed-to-parse-yaml-at-path
source: Failed to parse YAML at %@: %@
es_419: No se pudo analizar YAML en %@: %@

# server-manager.config.error.invalid-custom-provider-configuration
source: Invalid custom provider configuration. %@
es_419: Configuración de proveedor personalizado inválida. %@

# server-manager.config.status.path-changed-restarting-server
source: Config path changed; restarting server
es_419: Ruta de configuración modificada; reiniciando servidor

# server-manager.config.status.updated-hot-reload
source: Config updated (hot reload)
es_419: Configuración actualizada (hot reload)

# app-menu.about-vibeproxy
source: About VibeProxy
es_419: Acerca de VibeProxy

# app-menu.quit-vibeproxy
source: Quit VibeProxy
es_419: Salir de VibeProxy

# menu.edit.title
source: Edit
es_419: Editar

# menu.edit.undo
source: Undo
es_419: Deshacer

# menu.edit.redo
source: Redo
es_419: Rehacer

# menu.edit.cut
source: Cut
es_419: Cortar

# menu.edit.copy
source: Copy
es_419: Copiar

# menu.edit.paste
source: Paste
es_419: Pegar

# menu.edit.select-all
source: Select All
es_419: Seleccionar todo

# status-menu.server.stopped
source: Server: Stopped
es_419: Servidor: Detenido

# status-menu.open-settings
source: Open Settings
es_419: Abrir Ajustes

# status-menu.start-server
source: Start Server
es_419: Iniciar servidor

# status-menu.copy-server-url
source: Copy Server URL
es_419: Copiar URL del servidor

# status-menu.open-dashboard
source: Open Dashboard
es_419: Abrir Dashboard

# status-menu.check-for-updates
source: Check for Updates...
es_419: Buscar actualizaciones...

# status-menu.quit
source: Quit
es_419: Salir

# notification.server-started.title
source: Server Started
es_419: Servidor iniciado

# notification.server-started.body
source: VibeProxy is now running
es_419: VibeProxy ya está en ejecución

# notification.server-failed.title
source: Server Failed
es_419: Falló el servidor

# notification.server-failed.body
source: Could not start backend server on port 8318
es_419: No se pudo iniciar el servidor backend en el puerto 8318

# notification.server-failed.thinking-proxy-timeout-body
source: Could not start thinking proxy on port 8317 (timeout)
es_419: No se pudo iniciar el thinking proxy en el puerto 8317 (timeout)

# notification.clipboard.copied.title
source: Copied
es_419: Copiado

# notification.clipboard.server-url-copied.body
source: Server URL copied to clipboard
es_419: URL del servidor copiada al portapapeles

# status-menu.server.running-port
source: Server: Running (port %d)
es_419: Servidor: En ejecución (puerto %d)

# status-menu.stop-server
source: Stop Server
es_419: Detener servidor
